### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

In [2]:
# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Calculate the percentage of students who passed math **and** reading (% Overall Passing)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [3]:
# Calculate the total number of schools
school_count = school_data.count()

In [4]:
# Calculate the total number of students
student_count = student_data.count()

In [5]:
# Calculate the total budget 
total_budget = school_data.sum(numeric_only = True)

In [6]:
# Calculate the average math score
# Calculate the average reading score
test_score_mean = student_data.mean(numeric_only = True)
test_score_reading = test_score_mean[1]
test_score_math =  test_score_mean[2]

In [8]:
# Calculate the percentage of students with a passing math score (70 or greater)

student_passing_math = student_data.loc[student_data["math_score"] > 70]
student_passing_math_count = student_passing_math.count()
percent_pass_m = (student_passing_math_count/student_count[0])*100

In [9]:
# Calculate the percentage of students with a passing reading score (70 or greater)
student_passing_reading = student_data.loc[student_data["reading_score"] > 70]
student_passing_reading_count = student_passing_reading.count()
percent_pass_r = (student_passing_reading_count/student_count[0])*100

In [10]:
# Calculate the percentage of students who passed math and reading (% Overall Passing)
student_passing_both =  student_data.loc[(student_data["reading_score"] > 70) &  (student_data["math_score"] > 70)]
student_passing_both_count = student_passing_both.count()
percent_pass_b = (student_passing_both_count/student_count[0])*100

In [11]:
district_totals = pd.DataFrame(columns = ["Total Schools","Total Students","Total Budget","Avg Math Score", "Avg Reading Score", "% Passing Math","% Passing Reading","% Passing Both"])
district_totals.at[0,"Total Schools"] = school_count[0]
district_totals.at[0,"Total Students"] = student_count[0]
district_totals.at[0,"Total Budget"] = total_budget[0]
district_totals.at[0,"Avg Math Score"] = test_score_math
district_totals.at[0,"Avg Reading Score"] = test_score_reading
district_totals.at[0,"% Passing Math"] = percent_pass_m [0]
district_totals.at[0,"% Passing Reading"] = percent_pass_r[0]
district_totals.at[0,"% Passing Both"] = percent_pass_b [0]
district_totals

,Total Schools,Total Students,Total Budget,Avg Math Score,Avg Reading Score,% Passing Math,% Passing Reading,% Passing Both
0,15,39170,105,78.985371,81.87784,72.392137,82.971662,60.801634

In [ ]:
# Format Output of Dataframe (optional)

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * % Overall Passing (The percentage of students that passed math **and** reading.)
  
* Create a dataframe to hold the above results

In [37]:
school_data.rename(columns = {'school_name' : 'School Name', 'type' : 'School Type', 'size' : 'Total Students', 'budget' : 'Total School Budget'}, inplace = True)
school_data
# School Name, School Type, Total Students, Total School Budget - from school_data

,School ID,School Name,School Type,Total Students,Total School Budget
0,0,Huang High School,District,2917,1910635
1,1,Figueroa High School,District,2949,1884411
2,2,Shelton High School,Charter,1761,1056600
3,3,Hernandez High School,District,4635,3022020
4,4,Griffin High School,Charter,1468,917500
5,5,Wilson High School,Charter,2283,1319574
6,6,Cabrera High School,Charter,1858,1081356
7,7,Bailey High School,District,4976,3124928
8,8,Holden High School,Charter,427,248087
9,9,Pena High School,Charter,962,585858
10,10,Wright High School,Charter,1800,1049400
11,11,Rodriguez High School,District,3999,2547363
12,12,Johnson High School,District,4761,3094650
13,13,Ford High School,District,2739,1763916
14,14,Thomas High School,Charter,1635,1043130

In [53]:
# Add a per student budget to school_data 
school_data['Per Student Budget'] =  ( school_data['Total School Budget'] /school_data['Total Students'] )
school_data.head()

,School ID,School Name,School Type,Total Students,Total School Budget,Per Student Budget
0,0,Huang High School,District,2917,1910635,655.0
1,1,Figueroa High School,District,2949,1884411,639.0
2,2,Shelton High School,Charter,1761,1056600,600.0
3,3,Hernandez High School,District,4635,3022020,652.0
4,4,Griffin High School,Charter,1468,917500,625.0

In [45]:
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [52]:
# group by the high school and get the mean reading score 
student_scores = student_data.groupby(["school_name"])

student_scores_mean = student_scores.mean()
#student_scores_mean.loc(:,['reading_score'],['math_score'])
student_scores_mean

# create a master data frame to merge school data and student data

                       Student ID  reading_score  math_score
school_name
Bailey High School        20358.5      81.033963   77.048432
Cabrera High School       16941.5      83.975780   83.061895
Figueroa High School       4391.0      81.158020   76.711767
Ford High School          36165.0      80.746258   77.102592
Griffin High School       12995.5      83.816757   83.351499
Hernandez High School      9944.0      80.934412   77.289752
Holden High School        23060.0      83.814988   83.803279
Huang High School          1458.0      81.182722   76.629414
Johnson High School       32415.0      80.966394   77.072464
Pena High School          23754.5      84.044699   83.839917
Rodriguez High School     28035.0      80.744686   76.842711
Shelton High School        6746.0      83.725724   83.359455
Thomas High School        38352.0      83.848930   83.418349
Wilson High School        14871.0      83.989488   83.274201
Wright High School        25135.5      83.955000   83.682222

In [20]:
# "% Passing Math","% Passing Reading","Overall Passing"])
# find the rows -> group by -> get the number of rows that are above 70

pandas.core.series.Series

In [ ]:
school_totals = pd.DataFrame(columns = ["School Name","School Type","Total Students","Total School Budget","Per Student Budget","Avg Math Score", "Avg Reading Score", "% Passing Math","% Passing Reading","Overall Passing"])
school_totals

## Top Performing Schools (By % Overall Passing)

* Sort and display the top five performing schools by % overall passing.

In [ ]:
# example sort values: strongest_pokemon_df = pokemon_comparison_df.sort_values(["Total"], ascending=False)

## Bottom Performing Schools (By % Overall Passing)

* Sort and display the five worst-performing schools by % overall passing.

In [ ]:
# example sort values: strongest_pokemon_df = pokemon_comparison_df.sort_values(["Total"], ascending=False)

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

In [ ]:
# example grouped_international_data = converted_ufo_df.groupby(['country', 'state'])

## Reading Score by Grade

* Perform the same operations as above for reading scores

In [ ]:
# example grouped_international_data = converted_ufo_df.groupby(['country', 'state'])

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [ ]:
bins = [0,100000,200000,300000,600000]
group_names =  ["Less than 99,000","100,000 - 199,000","200,000 - 299,000","300,000 - 499,000","500,000 - 599,000"]

## Scores by School Size

* Perform the same operations as above, based on school size.

## Scores by School Type

* Perform the same operations as above, based on school type